{
  "company_backgrounds": {
    "Rug Pull & Run LLC": {
      "background": "Started as a legitimate crypto project, but the founders had a sudden change of heart and decided to test the 'pull' part of their company name. Now they're wanted in 7 countries, but their token still somehow trades on unregulated exchanges.",
      "image": "/images/companies/rug-pull.png"
    },
    
    "Exit Scam Speedway": "Started as a legitimate crypto project until the founders discovered they could make more money by disappearing. Now they offer 'disappearance as a service' to other crypto projects.",
    
    "Ponzi Scheme Palace": {
      "background": "Their business model is so transparent that it's almost admirable. They promise 1000% returns in 24 hours, and somehow people still fall for it. Their headquarters is a cardboard box behind a Wendy's.",
      "image": "/images/companies/ponzi.png"
    },
    
    "Pump & Dump Morgue": "Founded by a group of failed day traders who found their true calling in manipulating crypto prices. Their office is decorated with tombstones of dead altcoins they've helped bury.",
    
    "Bagholder's Graveyard": {
      "background": "A support group turned investment firm. They specialize in buying the absolute peak of every crypto trend. Their office is decorated with framed screenshots of all-time-high purchases.",
      "image": "/images/companies/bagholder.png"
    },
    
    "Margin Call Crematorium": {
      "background": "They started as a funeral home but pivoted to crypto when they realized both businesses deal with people who are financially dead. Their slogan: 'We'll liquidate your positions before we liquidate you.'",
      "image": "/images/companies/margin-call.png"
    },
    
    "Liquidation Liquor & Guns": "A one-stop shop for traders who've lost everything. They sell both the means to drown your sorrows and end them. Their best-selling product is the 'Margin Call Martini' - one shot and you're done.",
    
    "Paper Hands Suicide Hotline": {
      "background": "A 24/7 support service for traders who sold too early. Their call center is staffed by former day traders who understand the pain of watching a coin moon right after selling.",
      "image": "/images/companies/paper-hands.png"
    },
    
    "Whale Food Processing Plant": {
      "background": "Specializes in turning retail investors into whale food. Their patented 'Pump and Dump' machine has been featured in several SEC investigations.",
      "image": "/images/companies/whale-food.png"
    },
    
    "Gas Fee Extortion Inc": {
      "background": "Founded by former mob accountants who realized crypto gas fees were more profitable than protection money. They've cornered the market on 'accidentally' setting transaction fees to $1000.",
      "image": "/images/companies/gas-fee.png"
    },
    
    "Rekt City Morgue": "A blockchain forensics company that specializes in documenting how people lost everything. Their most popular service is the 'Autopsy Report' showing exactly where your portfolio went wrong.",
    
    "Moon or Coffin Express": {
      "background": "A delivery service that specializes in sending either champagne or funeral wreaths to traders, depending on their portfolio performance. Their motto: 'To the moon or to the grave!'",
      "image": "/images/companies/moon-coffin.png"
    },
    
    "Degen's Death Wish": {
      "background": "A hedge fund that only invests in projects with red flags. Their research department consists of a Magic 8-Ball and a dartboard with random crypto terms.",
      "image": "/images/companies/degen.png"
    },
    
    "Zero to Hero (Definitely Zero)": "Started as a legitimate trading education platform, but their students kept losing money. Now they just sell 'I survived crypto trading' t-shirts.",
    
    "All In or Cremation": "A casino that only accepts crypto and has a special room for traders who want to go all-in. The room has two doors: one leads to a Lamborghini dealership, the other to a crematorium.",
    
    "YOLO or YOLO": "A financial advisory firm that gives only two pieces of advice: 'You Only Live Once' and 'You Only Lose Once'. Their office is shaped like a coin.",
    
    "Lambo or Living Under Bridge": "A car dealership that only accepts crypto and has a special section under a bridge for customers who can't pay. Their showroom is next to a homeless shelter.",
    
    "HODL or Hospice": {
      "background": "A retirement home for crypto traders who refuse to sell at a loss. Their medical staff is trained to respond to phrases like 'It's not a loss until you sell' and 'Diamond hands forever'.",
      "image": "/images/companies/hodl.png"
    },
    
    "Crypto Casino of Despair": "Where dreams go to die. Their slot machines are rigged to only pay out in shitcoins. The house always wins, especially when you're trading futures.",
    
    "Trading Addiction Asylum": "A rehab center that's worse than the addiction. Patients are forced to watch charts 24/7 and are only allowed to sleep during sideways markets.",
    
    "Margin Call Massacre": "A support group that turned into a fight club. Members beat each other up instead of their keyboards. Their therapy involves watching their portfolios die in real-time.",
    
    "Liquidation Liquor & Funeral Services": "A bar that doubles as a funeral home. They have a special 'Liquidation Happy Hour' where drinks get more expensive as your portfolio value drops.",
    
    "Paper Hands Pawn & Cremation": "Where weak hands go to die. They buy your crypto at 10% of value and offer free cremation services with every purchase. Their motto: 'Sell low, die high'.",
    
    "Whale Food Slaughterhouse": "A data analytics firm that identifies small traders and sells their patterns to whales. Their office is decorated with framed screenshots of rekt positions.",
    
    "Gas Fee Extortion & Burial": "An Ethereum scaling solution that's actually just a protection racket. Pay their fees or your transactions get 'lost'. They also offer burial services for dead tokens.",
    
    "Rekt City Cemetery": "A digital graveyard for dead coins. Each token gets a proper burial with a eulogy written by its last bagholder. Visitors can leave flowers (in crypto) at the graves.",
    
    "Moon or Morgue Travel": "A space tourism company that either sends you to the moon or arranges your funeral, depending on how your latest trade went. No middle ground.",
    
    "Degen's Death Row": "A trading floor where only the most degenerate strategies are allowed. Their risk management department is just a guy flipping a coin.",
    
    "Zero to Hero (Just Zero)": "A motivational speaking company that realized all their clients ended up at zero anyway. Now they just sell 'I told you so' cards in bulk.",
    
    "All In or Autopsy": "A medical examiner's office that specializes in crypto-related deaths. Their most common cause of death: 'acute rekt syndrome'. They accept payment in any coin, living or dead."
  }
} 